# Pandas

In [7]:
import pandas as pd
import numpy as np

## 1. Creating series

In [18]:
#create from a list
data=[10,20,30,40,50]
d1=pd.Series(data)
print(d1)
#create from 1D array
data=np.array([1.1,2.2,3.3,4.4])
d2=pd.Series(data)
print(d2)
#create from dictionary
data={'a':1,'b':2,'c':3}
d3=pd.Series(data)
print(d3)

#custom index with series - for list & array only
data=[10,20,30,40]
print(data)
d4=pd.Series(data,index=['a','b','c','d'])
print(d4)

0    10
1    20
2    30
3    40
4    50
dtype: int64
0    1.1
1    2.2
2    3.3
3    4.4
dtype: float64
a    1
b    2
c    3
dtype: int64
[10, 20, 30, 40]
a    10
b    20
c    30
d    40
dtype: int64

In [5]:
#create form list
data=[10,20,30,40,50]
s1=pd.Series(data)
print(s1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [35]:
#to check

a=[10,20,30,40,50]
b=pd.Series(a)

print(b.dtype)
print(b.info())   #used for DataFrame,in Series-will not provide detailed stats
print(b.size)     #number of elements in the Series
print(b.astype(float))     #convert data type
print(b.drop(0))

int64
<class 'pandas.core.series.Series'>
RangeIndex: 5 entries, 0 to 4
Series name: None
Non-Null Count  Dtype
--------------  -----
5 non-null      int64
dtypes: int64(1)
memory usage: 172.0 bytes
None
5
0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
dtype: float64
1    20
2    30
3    40
4    50
dtype: int64

In [7]:
custom_index=["a","b","c","d","e"]
s1_customind=pd.Series(data,index=custom_index)
print(s1_customind)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [24]:
#create from numpy array-dont have index
import numpy as np
narr=np.array([10,20,30,40,50])

s_numpy=pd.Series(narr)
print(s_numpy)

#output error bec no 'c' label in the Series
new_series=s_numpy.drop("c")
print(new_series)

0    10
1    20
2    30
3    40
4    50
dtype: int32

KeyError: "['c'] not found in axis"

In [26]:
#to fix above code
narr=np.array([10,20,30,40,50])
s_numpy=pd.Series(narr)
print(s_numpy)

#drop an index
new_series=s_numpy.drop(2)
print(new_series)

0    10
1    20
2    30
3    40
4    50
dtype: int32
0    10
1    20
3    40
4    50
dtype: int32

In [13]:
#create form dictionary-need to key in key & value pair

dict={"a":10,"b":20,"c":30,"d":40,"e":50}
s_dict=pd.Series(dict)
print(s_dict)

a    10
b    20
c    30
d    40
e    50
dtype: int64

## 2. Creating Data frame

In [20]:
#From a list of lists
data=[[1,2],[3,4],[5,6]]
df1=pd.DataFrame(data,index=['Row1','Row2','Row3'],columns=['Column1','Column2'])
print(df1)
#From 2D Numpy array
array_data=np.array([[1,2],
                   [3,4],
                   [5,6]])
arr1=pd.DataFrame(array_data,index=['Row1','Row2','Row3'],columns=['Column1','Column2'])
print(arr1)
#From a dictionary
dict_data={'R1':[1,2,3],'R2':[4,5,6]}
dict=pd.DataFrame(dict_data,index=['Row1','Row2','Row3'])
print(dict)

      Column1  Column2
Row1        1        2
Row2        3        4
Row3        5        6
      Column1  Column2
Row1        1        2
Row2        3        4
Row3        5        6
      R1  R2
Row1   1   4
Row2   2   5
Row3   3   6

In [18]:
#from list of list
data_list=[[1,5,6],[2,6,10],[3,7,11]]
df_from_list=pd.DataFrame(data_list,columns=["A","B","C"],index=["r1","r2","r3"])
print(df_from_list)

    A  B   C
r1  1  5   6
r2  2  6  10
r3  3  7  11

In [42]:
#from 2D numpy
data_numpy=np.array([[1,5,6],[2,6,10],[3,7,11]])
df_from_numpy=pd.DataFrame(data_numpy,columns=["A","B","C"],index=["r1","r2","r3"])
print(df_from_numpy)

    A  B   C
r1  1  5   6
r2  2  6  10
r3  3  7  11

In [22]:
#from dictionary-output will be error
data_dict={
    "A":[1,2,3],
    "B":[5,6,7],
    "C":[6,10,11]
}

df=pd.Series(data_dict["A","B","C"],index=["r1","r2","r3"])
print(df)

KeyError: ('A', 'B', 'C')

In [30]:
#to fix above code
print(data_dict)
df=pd.Series(data_dict['A'],index=['r1','r2','r3'])
print(df)
#use dataframe to store multiple columns

{'A': [1, 2, 3], 'B': [5, 6, 7], 'C': [6, 10, 11]}
r1    1
r2    2
r3    3
dtype: int64

In [32]:
df2=pd.DataFrame(
    {
        "Name":["Ahmad","Ali","Ain"],
        "Age":[30,25,23],
        "Sex":["male","male","female"]
    })

print(df2)

    Name  Age     Sex
0  Ahmad   30    male
1    Ali   25    male
2    Ain   23  female

In [40]:
s_numpy.size

5

In [56]:
df2.drop("Age",axis=1)

    Name     Sex
0  Ahmad    male
1    Ali    male
2    Ain  female

In [58]:
df2.drop(0)   #drop 1st row

  Name  Age     Sex
1  Ali   25    male
2  Ain   23  female

In [62]:
df2.drop([0,2])   #drop 1st & 3rd row

  Name  Age   Sex
1  Ali   25  male

In [66]:
df2.drop(["Name","Age"],axis=1)

      Sex
0    male
1    male
2  female

In [70]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Sex     3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [72]:
df2.shape

(3, 3)

In [78]:
df2.head(2)

    Name  Age   Sex
0  Ahmad   30  male
1    Ali   25  male

In [80]:
df2.tail(2)

  Name  Age     Sex
1  Ali   25    male
2  Ain   23  female

In [ ]:
#create form dictionary-need to key in key & value pair

dict={"a":10,"b":20,"c":30,"d":40,"e":50}
s_dict=pd.Series(dict)
print(s_dict)

In [82]:
s_dict["b"]

20

In [84]:
s_dict.iloc[1]

20

In [90]:
s_dict[[1,2,3]]

C:\Users\PC 14\AppData\Local\Temp\ipykernel_6288\1216125954.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s_dict[[1,2,3]]

b    20
c    30
d    40
dtype: int64

In [92]:
s_dict[s_dict>20]

c    30
d    40
e    50
dtype: int64

In [94]:
#from dictionary
data_dict={
    "A":[1,2,3],
    "B":[5,6,7],
    "C":[6,10,11]
}

df=pd.DataFrame(data_dict,index=["r1","r2","r3"])
print(df)

    A  B   C
r1  1  5   6
r2  2  6  10
r3  3  7  11

In [96]:
df["A"]

r1    1
r2    2
r3    3
Name: A, dtype: int64

In [98]:
df[["A","B"]]

    A  B
r1  1  5
r2  2  6
r3  3  7

In [100]:
df.loc["r1"]    #to call row need loc, if column no need loc

A    1
B    5
C    6
Name: r1, dtype: int64

In [102]:
df.iloc[1,1]    # to call the integer

6

In [104]:
df.iloc[:,-1]    #all row, last column

r1     6
r2    10
r3    11
Name: C, dtype: int64

In [106]:
df.iloc[-1,1:]

B     7
C    11
Name: r3, dtype: int64

## 3. Arithmetric

In [42]:
#Arithmetic on panda series-applied element wise
s1=pd.Series([1,2,3],index=['a','b','c'])
s2=pd.Series([4,5,6],index=['a','b','c'])
print(s1+s2)

#Arithmetic on panda dataframes-applied element-wise across rows & columns
df1=pd.DataFrame({
    'A':[1,2,3],
    'B':[4,5,6]},
    index=['r1','r2','r3'])
df2=pd.DataFrame({
    'A':[7,8,9],
    'B':[10,11,12]},
    index=['r1','r2','r3'])
print(df1+df2)

#Arithmetic with scalars
print(df1+10)
print(df1*2)

a    5
b    7
c    9
dtype: int64
     A   B
r1   8  14
r2  10  16
r3  12  18
     A   B
r1  11  14
r2  12  15
r3  13  16
    A   B
r1  2   8
r2  4  10
r3  6  12

In [111]:
s1=pd.Series([1,2,3,4])
s2=pd.Series([10,20,30,40])

add_r=s1+s2
print(add_r)

mult_r=s1*s2
print(mult_r)

0    11
1    22
2    33
3    44
dtype: int64
0     10
1     40
2     90
3    160
dtype: int64

In [123]:
df1=pd.DataFrame({"A":[1,2],"B":[3,4]},index=["r1","r2"])
df2=pd.DataFrame({"A":[10,20],"B":[30,40]},index=["r2","r3"])

add_r=df1+df2
print(add_r)

       A     B
r1   NaN   NaN
r2  12.0  34.0
r3   NaN   NaN

In [127]:
df=pd.DataFrame({"A":[1,2]})
s=pd.Series([1,2])

mult_r=4*df
print(mult_r)

   A
0  4
1  8

In [131]:
#create dataframe with duplicate column

data={"A":[1,2,3],"B":[4,5,6],"A":[7,8,9]}    #new A will overwrite the old A
df=pd.DataFrame(data)
print(df)

   A  B
0  7  4
1  8  5
2  9  6

In [137]:
#Create from numpy
data_array=np.array([[1,5,9],[2,6,10],[3,7,11],[4,8,12]])
df=pd.DataFrame(data_array,columns=["A","B","A"])    #can create all column even has same column name
print(df)
print(df["A"])   #run all column name

   A  B   A
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12
   A   A
0  1   9
1  2  10
2  3  11
3  4  12

In [153]:
#Create from numpy
data_array=np.array([[1,5,9],[2,6,10],[3,7,11],[4,8,12]])
df=pd.DataFrame(data_array,columns=["A","B","A"],index=["r1","r1","r2","r3"])    
print(df)
print(df["A"])
print(df.loc["r1"])
print(df.loc["r1"]*2)

    A  B   A
r1  1  5   9
r1  2  6  10
r2  3  7  11
r3  4  8  12
    A   A
r1  1   9
r1  2  10
r2  3  11
r3  4  12
    A  B   A
r1  1  5   9
r1  2  6  10
    A   B   A
r1  2  10  18
r1  4  12  20

## 4. Duplicates

In [59]:
#Duplicate labels
df=pd.DataFrame({
    'A':[1,2,3,4],
    'B':[5,6,7,8]},index=['r1','r2','r1','r4'])
print(df)

#Access rows with duplicate labels
print(df.loc['r1'])

#Check for duplicate index labels
print(df.index.duplicated())

#Check if any duplicate label exist
print(df.index.has_duplicates)

#Remove duplicate rows
print(df[~df.index.duplicated()])

    A  B
r1  1  5
r2  2  6
r1  3  7
r4  4  8
    A  B
r1  1  5
r1  3  7
[False False  True False]
True
    A  B
r1  1  5
r2  2  6
r4  4  8

In [155]:
df.index.duplicated()

array([False,  True, False, False])

In [159]:
df.columns.duplicated()

array([False, False,  True])

In [161]:
df[~df.index.duplicated()]   #remove the duplicated

    A  B   A
r1  1  5   9
r2  3  7  11
r3  4  8  12

In [167]:
df.T

   r1  r1  r2  r3
A   1   2   3   4
B   5   6   7   8
A   9  10  11  12

In [165]:
df.T[~df.T.index.duplicated()].T    #cannot use column only, need transpose(T)

    A  B
r1  1  5
r1  2  6
r2  3  7
r3  4  8

## 5. Descriptive statistics

In [169]:
df.describe()

              A         B          A
count  4.000000  4.000000   4.000000
mean   2.500000  6.500000  10.500000
std    1.290994  1.290994   1.290994
min    1.000000  5.000000   9.000000
25%    1.750000  5.750000   9.750000
50%    2.500000  6.500000  10.500000
75%    3.250000  7.250000  11.250000
max    4.000000  8.000000  12.000000

In [171]:
df.median()

A     2.5
B     6.5
A    10.5
dtype: float64

In [173]:
df.count()

A    4
B    4
A    4
dtype: int64

In [177]:
df["B"].nunique()

4

In [181]:
data=pd.Series([10,20,30,40,50])
data.isin([20,40])

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [193]:
data_array=np.array([[1,5,9],[2,6,10],[3,7,11],[4,8,12]])
df=pd.DataFrame(data_array,columns=["A","B","C"],index=["r0","r1","r2","r3"])    
df["A"].isin([5])

r0    False
r1    False
r2    False
r3    False
Name: A, dtype: bool

In [197]:
data_array=np.array([[1,5,9],[2,6,10],[3,7,11],[4,8,12]])
df=pd.DataFrame(data_array,columns=["A","B","C"],index=["r0","r1","r2","r3"])    
df[["A","B"]].isin([5])

        A      B
r0  False   True
r1  False  False
r2  False  False
r3  False  False

## 6. Function application & mapping

In [74]:
#using .apply()
s=pd.Series([1,2,3,4,5])
s1=s.apply(lambda x:x**2)
print(s1)

df=pd.DataFrame({
    'A':[1,2,3],
    'B':[4,5,6]})
df1=df.apply(lambda x:x*2)
print(df1)

row_sum=df.apply(lambda x:x.sum(),axis=1)
print(row_sum)

0     1
1     4
2     9
3    16
4    25
dtype: int64
   A   B
0  2   8
1  4  10
2  6  12
0    5
1    7
2    9
dtype: int64

In [68]:
#using .applymap()
inc=df.applymap(lambda x:x+1)
print(inc)

   A  B
0  2  5
1  3  6
2  4  7

C:\Users\mahan\AppData\Local\Temp\ipykernel_2576\322086524.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  inc=df.applymap(lambda x:x+1)

In [72]:
#using .map()
s=pd.Series([1,2,3,4,5])
s2=s.map(lambda x:x**2)
print(s2)

mapped=s.map({1:'one',2:'two',3:'three'})
print(mapped)

0     1
1     4
2     9
3    16
4    25
dtype: int64
0      one
1      two
2    three
3      NaN
4      NaN
dtype: object

In [199]:
##apply ufunct to series

data=pd.Series([10,20,30,40,50])
np.sum(data)

150

In [219]:
##apply ufunct to dataframe
data={"A":[1,2,3],"B":[3,4,5]}
df=pd.DataFrame(data)
print(df)
np.square(df)

   A  B
0  1  3
1  2  4
2  3  5

   A   B
0  1   9
1  4  16
2  9  25

In [221]:
np.sum(df)

C:\ProgramData\anaconda3\Lib\site-packages\numpy\core\fromnumeric.py:86: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)

A     6
B    12
dtype: int64

In [223]:
df.apply(np.sum,axis=1)

0    4
1    6
2    8
dtype: int64

In [225]:
df.apply(np.sum,axis=0)

A     6
B    12
dtype: int64

In [227]:
df.applymap(lambda x:x**3)

C:\Users\PC 14\AppData\Local\Temp\ipykernel_6288\1284942387.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x:x**3)

    A    B
0   1   27
1   8   64
2  27  125

In [231]:
def pow3(x):
    return x**3
df.applymap(pow3)

C:\Users\PC 14\AppData\Local\Temp\ipykernel_6288\1315440664.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(pow3)

    A    B
0   1   27
1   8   64
2  27  125

In [241]:
data={
    "City":["KL","Klang","Klang","Kajang"],
    "Product":["a","b","b","a"],
    "Sales":[2000,1500,3000,3500]
}

df=pd.DataFrame(data)
print(df)

     City Category  Sales
0      KL        a   2000
1   Klang        b   1500
2   Klang        b   3000
3  Kajang        a   3500

## 7. Pivot tables & Cross tabulation

In [82]:
#Pivot table
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Salary': [50000, 60000, 70000, 80000, 90000, 100000],
    'Experience': [2, 3, 4, 5, 6, 7]}
df = pd.DataFrame(data)

#Create a pivot table
pivot = pd.pivot_table(df, values='Salary', index='Department', aggfunc='mean')
print(pivot)
#create a pivot table with multile aggregations
pivot1=pd.pivot_table(
    df, values=['Salary', 'Experience'], 
    index='Department', 
    aggfunc={'Salary': 'mean', 'Experience': 'sum'})
print(pivot1)

             Salary
Department
Finance     95000.0
HR          55000.0
IT          75000.0
            Experience   Salary
Department
Finance             13  95000.0
HR                   5  55000.0
IT                   9  75000.0

In [92]:
#Cross-tabulation
data = {
    'Gender': ['Male', 'Female', 'Female', 'Male', 'Male', 'Female'],
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance']}
df = pd.DataFrame(data)

#Create a crosstab
crosstab = pd.crosstab(df['Gender'], df['Department'])
print(crosstab)
#Create a crosstab with aggregation
crosstab1 = pd.crosstab(df['Gender'], df['Department'], margins=True)
print(crosstab1)
#Crosstab using Salary values
data1={
    'Gender': ['Male', 'Female', 'Female', 'Male', 'Male', 'Female'],
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Salary': [50000, 60000, 70000, 80000, 90000, 100000]}
df = pd.DataFrame(data1)

crosstab2 = pd.crosstab(
    df['Gender'], df['Department'], 
    values=df['Salary'], aggfunc='mean')
print(crosstab2)

Department  Finance  HR  IT
Gender
Female            1   1   1
Male              1   1   1
Department  Finance  HR  IT  All
Gender
Female            1   1   1    3
Male              1   1   1    3
All               2   2   2    6
Department   Finance       HR       IT
Gender
Female      100000.0  60000.0  70000.0
Male         90000.0  50000.0  80000.0

In [9]:
#Create pd pivot_table(df,values="Sales",index="city"

data={
    "City":["KL","Klang","Klang","Kajang"],
    "Product":["a","b","b","a"],
    "Sales":[2000,1500,3000,3500]
}

df=pd.DataFrame(data)
print(df)
pivot_table=pd.pivot_table(df,values="Sales",index="City",columns="Product",aggfunc="sum")
print(pivot_table)

     City Product  Sales
0      KL       a   2000
1   Klang       b   1500
2   Klang       b   3000
3  Kajang       a   3500
Product       a       b
City
KL       2000.0     NaN
Kajang   3500.0     NaN
Klang       NaN  4500.0

In [11]:
#recheck back
crosstab=pd.crosstab(df["City"],df["Product"])
print(crosstab)

Product  a  b
City
KL       1  0
Kajang   1  0
Klang    0  2

In [259]:
df=pd.DataFrame({"A":[1,2,3],"B":[4,5,6]})

view=df["A"].copy()

view[0]=100

print("Original dataframe:")
print(df)

print("Modified dataframe:")
print(view)

Original dataframe:
   A  B
0  1  4
1  2  5
2  3  6
Modified dataframe:
0    100
1      2
2      3
Name: A, dtype: int64

In [261]:
df=pd.DataFrame({"A":[1,2,3],"B":[4,5,6]})

subset=df[df["A"]>1]
print(subset)

   A  B
1  2  5
2  3  6

In [275]:
df=pd.DataFrame({"A":[1,2,3],"B":[4,5,6]})

subset=df[df["A"]>2].copy()
print(subset)

   A  B
2  3  6

In [277]:
subset["B"]=100
print(subset)

   A    B
2  3  100